# 문제 1. 데이터 가져오기 
- titanic_train.csv 파일과 titanic_test.csv 파일을 불러오세요
- train, test로 저장하기

In [1]:
import pandas as pd

# Load the titanic datasets
train = pd.read_csv('data/titanic_train.csv')
test = pd.read_csv('data/titanic_test.csv')

train.shape, test.shape

((891, 12), (418, 11))

# 문제 2. loc 활용
- Passenger ID가 9인 승객 정보 가져오기
- loc문법만 활용

In [2]:
train.loc[8]

PassengerId                                                    9
Survived                                                       1
Pclass                                                         3
Name           Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
Sex                                                       female
Age                                                         27.0
SibSp                                                          0
Parch                                                          2
Ticket                                                    347742
Fare                                                     11.1333
Cabin                                                        NaN
Embarked                                                       S
Name: 8, dtype: object

# 문제 3. loc 활용
- Passenger ID가 1-10사이에서 짝수 ID만 가져오기 (슬라이싱만 활용)
- 특정 컬럼만 조회 : PassengerId, Survived, Sex, Fare, Embarked
- loc문법만 활용

In [3]:

train.loc[1:9:2, ['PassengerId', 'Survived', 'Sex', 'Fare', 'Embarked']]

   PassengerId  Survived     Sex     Fare Embarked
1            2         1  female  71.2833        C
3            4         1  female  53.1000        S
5            6         0    male   8.4583        Q
7            8         0    male  21.0750        S
9           10         1  female  30.0708        C

# 문제 4. GroupBy 연산
- 아래와 같이 pivot Table 구현한 것을 Group By 연산으로 적용할 것

In [4]:
train.pivot_table(index='Sex', columns='Pclass', values='Fare', aggfunc='mean')

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [5]:
train.groupby(['Sex', 'Pclass'])['Fare'].mean().unstack()

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

# 문제 5 Join문제
- members.csv와 orders.csv 파일 확인
    + members.csv : 회원정보 
    + orders.csv : 주문정보 
- 성별, 연령별 평균금액 구하기
- 주의) CSV 파일 열어보지 말기

In [6]:
# 데이터 읽기
members = pd.read_csv('data/members.csv')
orders = pd.read_csv('data/orders.csv')

# members와 orders 테이블의 컬럼명 확인
print("Members columns:", members.columns)
print("Orders columns:", orders.columns)

df = pd.merge(members, orders, on='회원ID', how='left')
result = df.groupby(['성별', '나이'])['주문금액'].mean()
result

Members columns: Index(['회원ID', '회원명', '나이', '성별'], dtype='object')
Orders columns: Index(['주문ID', '회원ID', '주문금액', '주문일자'], dtype='object')

성별  나이
F   27    40774.500000
    29    71044.666667
    32    39754.000000
    33             NaN
    35    45776.500000
M   25    50155.000000
    28    94127.500000
    31    84481.000000
    42    52919.000000
    45    65578.500000
Name: 주문금액, dtype: float64